FEATURES

The various features of the cleaned dataset are explained below:
1) Airline: The name of the airline company is stored in the airline column. It is a categorical feature having 6 different airlines.
2) Flight: Flight stores information regarding the plane's flight code. It is a categorical feature.
3) Source City: City from which the flight takes off. It is a categorical feature having 6 unique cities.
4) Departure Time: This is a derived categorical feature obtained created by grouping time periods into bins. It stores information about the departure time and have 6 unique time labels.
5) Stops: A categorical feature with 3 distinct values that stores the number of stops between the source and destination cities.
6) Arrival Time: This is a derived categorical feature created by grouping time intervals into bins. It has six distinct time labels and keeps information about the arrival time.
7) Destination City: City where the flight will land. It is a categorical feature having 6 unique cities.
8) Class: A categorical feature that contains information on seat class; it has two distinct values: Business and Economy.
9) Duration: A continuous feature that displays the overall amount of time it takes to travel between cities in hours.
10)Days Left: This is a derived characteristic that is calculated by subtracting the trip date by the booking date.
11) Price: Target variable stores information of the ticket price.

In [1]:
# importing necessary libraries

import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
# loading the dataset
df=pd.read_excel('flight_price.xlsx')

In [3]:
# checking first 5 records
df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302

In [4]:
# checking shape of the dataset
df.shape

(10683, 11)

In [5]:
print('Our dataset has', df.shape[0],'no. of rows and',df.shape[1],'no. of columns')

Our dataset has 10683 no. of rows and 11 no. of columns

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  object
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Dep_Time         10683 non-null  object
 6   Arrival_Time     10683 non-null  object
 7   Duration         10683 non-null  object
 8   Total_Stops      10682 non-null  object
 9   Additional_Info  10683 non-null  object
 10  Price            10683 non-null  int64
dtypes: int64(1), object(10)
memory usage: 918.2+ KB

Conlusion:
Our dataset has 11 categorical features, so we'll have to convert it into numerical features in order to train our model

In [7]:
# details of numerical features of our dataset
df.describe()

              Price
count  10683.000000
mean    9087.064121
std     4611.359167
min     1759.000000
25%     5277.000000
50%     8372.000000
75%    12373.000000
max    79512.000000

In [8]:
# checking null values

df.isnull().sum()

Airline            0
Date_of_Journey    0
Source             0
Destination        0
Route              1
Dep_Time           0
Arrival_Time       0
Duration           0
Total_Stops        1
Additional_Info    0
Price              0
dtype: int64

here we can simply delete the rows because the proportion of missing values is very very less.

In [9]:
# deleting the null values

df.dropna(inplace=True)

In [10]:
df.shape

(10682, 11)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10682 entries, 0 to 10682
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10682 non-null  object
 1   Date_of_Journey  10682 non-null  object
 2   Source           10682 non-null  object
 3   Destination      10682 non-null  object
 4   Route            10682 non-null  object
 5   Dep_Time         10682 non-null  object
 6   Arrival_Time     10682 non-null  object
 7   Duration         10682 non-null  object
 8   Total_Stops      10682 non-null  object
 9   Additional_Info  10682 non-null  object
 10  Price            10682 non-null  int64
dtypes: int64(1), object(10)
memory usage: 1001.4+ KB

In [12]:
# Taking feature Date_of_Journey
# here we can see that the datatype of Date_of_Journey is object/ string. our model can't understand this
# se we'll have to convert this data into numerical form by using followwing steps.

df['Date_of_Journey'].str.split('/') #breaking the string where / is coming

0        [24, 03, 2019]
1         [1, 05, 2019]
2         [9, 06, 2019]
3        [12, 05, 2019]
4        [01, 03, 2019]
              ...
10678     [9, 04, 2019]
10679    [27, 04, 2019]
10680    [27, 04, 2019]
10681    [01, 03, 2019]
10682     [9, 05, 2019]
Name: Date_of_Journey, Length: 10682, dtype: object

In [13]:
df['Date']=df['Date_of_Journey'].str.split('/').str[0]
df['Month']=df['Date_of_Journey'].str.split('/').str[1]
df['Year']=df['Date_of_Journey'].str.split('/').str[2]

In [14]:
df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897,24,03,2019
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662,1,05,2019
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882,9,06,2019
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218,12,05,2019
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302,01,03,2019

In [15]:
# now we can easily drop our column 'Date_of_Journey'

df.drop(['Date_of_Journey'], axis=1, inplace=True)

In [16]:
df.head()

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897,24,03,2019
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662,1,05,2019
2,Jet Airways,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882,9,06,2019
3,IndiGo,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218,12,05,2019
4,IndiGo,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302,01,03,2019

In [17]:
# checking the data again
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10682 entries, 0 to 10682
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10682 non-null  object
 1   Source           10682 non-null  object
 2   Destination      10682 non-null  object
 3   Route            10682 non-null  object
 4   Dep_Time         10682 non-null  object
 5   Arrival_Time     10682 non-null  object
 6   Duration         10682 non-null  object
 7   Total_Stops      10682 non-null  object
 8   Additional_Info  10682 non-null  object
 9   Price            10682 non-null  int64
 10  Date             10682 non-null  object
 11  Month            10682 non-null  object
 12  Year             10682 non-null  object
dtypes: int64(1), object(12)
memory usage: 1.1+ MB

In [18]:
# here we can see that our features Date, Month and Year are object type. we'll have to convert them into numerical field.

df['Date']=df['Date'].astype(int)
df['Month']=df['Month'].astype(int)
df['Year']=df['Year'].astype(int)

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10682 entries, 0 to 10682
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10682 non-null  object
 1   Source           10682 non-null  object
 2   Destination      10682 non-null  object
 3   Route            10682 non-null  object
 4   Dep_Time         10682 non-null  object
 5   Arrival_Time     10682 non-null  object
 6   Duration         10682 non-null  object
 7   Total_Stops      10682 non-null  object
 8   Additional_Info  10682 non-null  object
 9   Price            10682 non-null  int64
 10  Date             10682 non-null  int32
 11  Month            10682 non-null  int32
 12  Year             10682 non-null  int32
dtypes: int32(3), int64(1), object(9)
memory usage: 1.0+ MB

In [20]:
# now we'll take feature Departure time

df['Dep_Time'].dtype

dtype('O')

In [21]:
df['Dep_Time'].unique()

array(['22:20', '05:50', '09:25', '18:05', '16:50', '09:00', '18:55',
       '08:00', '08:55', '11:25', '09:45', '20:20', '11:40', '21:10',
       '17:15', '16:40', '08:45', '14:00', '20:15', '16:00', '14:10',
       '22:00', '04:00', '21:25', '21:50', '07:00', '07:05', '09:50',
       '14:35', '10:35', '15:05', '14:15', '06:45', '20:55', '11:10',
       '05:45', '19:00', '23:05', '11:00', '09:35', '21:15', '23:55',
       '19:45', '08:50', '15:40', '06:05', '15:00', '13:55', '05:55',
       '13:20', '05:05', '06:25', '17:30', '08:20', '19:55', '06:30',
       '14:05', '02:00', '09:40', '08:25', '20:25', '13:15', '02:15',
       '16:55', '20:45', '05:15', '19:50', '20:00', '06:10', '19:30',
       '04:45', '12:55', '18:15', '17:20', '15:25', '23:00', '12:00',
       '14:45', '11:50', '11:30', '14:40', '19:10', '06:00', '23:30',
       '07:35', '13:05', '12:30', '15:10', '12:50', '18:25', '16:30',
       '00:40', '06:50', '13:00', '19:15', '01:30', '17:00', '10:00',
       '19:35', '15:30', '12:10', '16:10', '20:35', '22:25', '21:05',
       '05:35', '05:10', '06:40', '15:15', '00:30', '08:30', '07:10',
       '05:30', '14:25', '05:25', '10:20', '17:45', '13:10', '22:10',
       '04:55', '17:50', '21:20', '06:20', '15:55', '20:30', '17:25',
       '09:30', '07:30', '02:35', '10:55', '17:10', '09:10', '18:45',
       '15:20', '22:50', '14:55', '14:20', '13:25', '22:15', '11:05',
       '16:15', '20:10', '06:55', '19:05', '07:55', '07:45', '10:10',
       '08:15', '11:35', '21:00', '17:55', '16:45', '18:20', '03:50',
       '08:35', '19:20', '20:05', '17:40', '04:40', '17:35', '09:55',
       '05:00', '18:00', '02:55', '20:40', '22:55', '22:40', '21:30',
       '08:10', '17:05', '07:25', '15:45', '09:15', '15:50', '11:45',
       '22:05', '18:35', '00:25', '19:40', '20:50', '22:45', '10:30',
       '23:25', '11:55', '10:45', '11:15', '12:20', '14:30', '07:15',
       '01:35', '18:40', '09:20', '21:55', '13:50', '01:40', '00:20',
       '04:15', '13:45', '18:30', '06:15', '02:05', '12:15', '13:30',
       '06:35', '10:05', '08:40', '03:05', '21:35', '16:35', '02:30',
       '16:25', '05:40', '15:35', '13:40', '07:20', '04:50', '12:45',
       '10:25', '12:05', '11:20', '21:40', '03:00'], dtype=object)

In [22]:
# here we'll seperate hrs and minutes from Dep_time

df['Dep_hrs']=df['Dep_Time'].str.split(':').str[0].astype(int)
df['Dep_min']=df['Dep_Time'].str.split(':').str[1].astype(int)

In [23]:
df.head(2)

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Dep_hrs,Dep_min
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897,24,3,2019,22,20
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662,1,5,2019,5,50

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10682 entries, 0 to 10682
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10682 non-null  object
 1   Source           10682 non-null  object
 2   Destination      10682 non-null  object
 3   Route            10682 non-null  object
 4   Dep_Time         10682 non-null  object
 5   Arrival_Time     10682 non-null  object
 6   Duration         10682 non-null  object
 7   Total_Stops      10682 non-null  object
 8   Additional_Info  10682 non-null  object
 9   Price            10682 non-null  int64
 10  Date             10682 non-null  int32
 11  Month            10682 non-null  int32
 12  Year             10682 non-null  int32
 13  Dep_hrs          10682 non-null  int32
 14  Dep_min          10682 non-null  int32
dtypes: int32(5), int64(1), object(9)
memory usage: 1.1+ MB

In [25]:
# Now we can drop Dep_Time column
df.drop(['Dep_Time'], axis=1, inplace=True)

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10682 entries, 0 to 10682
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10682 non-null  object
 1   Source           10682 non-null  object
 2   Destination      10682 non-null  object
 3   Route            10682 non-null  object
 4   Arrival_Time     10682 non-null  object
 5   Duration         10682 non-null  object
 6   Total_Stops      10682 non-null  object
 7   Additional_Info  10682 non-null  object
 8   Price            10682 non-null  int64
 9   Date             10682 non-null  int32
 10  Month            10682 non-null  int32
 11  Year             10682 non-null  int32
 12  Dep_hrs          10682 non-null  int32
 13  Dep_min          10682 non-null  int32
dtypes: int32(5), int64(1), object(8)
memory usage: 1.0+ MB

In [27]:
# same thing we can do to Arrival_time

df['Arrival_Time'].unique()

array(['01:10 22 Mar', '13:15', '04:25 10 Jun', ..., '06:50 10 Mar',
       '00:05 19 Mar', '21:20 13 Mar'], dtype=object)

In [28]:
# fearture 'Arrival_time' has values with date also so we'll have to split the time in hrs and min and avoid date

df['arr_time']=df['Arrival_Time'].str.split(' ').str[0] # it'll remove date data

In [29]:
df['arr_time'].unique()

array(['01:10', '13:15', '04:25', '23:30', '21:35', '11:25', '10:25',
       '05:05', '19:15', '23:00', '22:55', '13:55', '09:20', '19:50',
       '12:35', '19:20', '13:20', '06:50', '21:50', '08:15', '03:35',
       '12:55', '23:15', '21:00', '20:20', '16:45', '19:00', '18:10',
       '15:15', '08:35', '11:05', '14:15', '10:55', '00:15', '02:45',
       '12:00', '23:55', '01:30', '09:25', '15:25', '15:35', '08:30',
       '10:05', '14:30', '07:55', '10:35', '22:35', '04:40', '07:25',
       '20:45', '14:25', '22:30', '23:20', '07:40', '22:50', '14:35',
       '08:55', '18:50', '09:05', '01:35', '09:40', '16:25', '11:10',
       '17:05', '17:50', '23:10', '08:45', '07:45', '16:10', '00:55',
       '23:35', '20:00', '00:40', '21:45', '18:15', '03:25', '04:15',
       '21:10', '21:05', '09:45', '18:05', '22:00', '15:30', '08:50',
       '08:00', '19:35', '11:20', '10:15', '12:45', '02:20', '07:15',
       '11:50', '18:30', '19:45', '21:20', '20:05', '09:10', '22:20',
       '10:10', '01:00', '23:50', '12:20', '20:25', '22:45', '21:25',
       '14:05', '00:05', '19:55', '16:20', '07:05', '19:10', '12:05',
       '04:05', '19:40', '17:55', '17:25', '00:30', '23:40', '23:05',
       '00:50', '13:45', '09:15', '20:35', '07:10', '09:35', '14:20',
       '04:45', '10:30', '19:25', '05:35', '09:00', '22:40', '14:45',
       '13:25', '21:55', '10:45', '10:40', '13:00', '22:10', '18:35',
       '05:25', '22:15', '12:10', '12:15', '14:00', '02:15', '12:50',
       '17:15', '07:35', '23:45', '22:25', '12:25', '06:35', '01:20',
       '18:45', '09:30', '04:20', '10:50', '23:25', '22:05', '13:30',
       '13:35', '17:35', '08:20', '18:25', '10:20', '15:50', '11:30',
       '14:10', '00:25', '03:15', '15:55', '00:45', '04:35', '18:00',
       '12:30', '02:10', '00:20', '21:40', '08:40', '16:55', '20:30',
       '17:20', '00:35', '20:15', '14:50', '13:40', '16:50', '15:05',
       '17:45', '18:40', '03:10', '16:40', '09:50', '13:05', '17:40',
       '20:40', '17:10', '20:50', '00:10', '08:10', '16:15', '16:05',
       '10:00', '16:35', '18:20', '04:00', '21:15', '14:40', '01:45',
       '16:30', '11:55', '15:20', '20:10', '15:00', '15:45', '12:40',
       '15:10', '13:10', '11:15', '03:40', '16:00', '11:35'], dtype=object)

In [30]:
df['Arr_Hrs']=df['arr_time'].str.split(':').str[0].astype(int)
df['Arr_Min']=df['arr_time'].str.split(':').str[1].astype(int)

# or in single step
# df['Arr_Hrs']=df['Arrival_Time'].str.split(' ').str.split(':').str[0]

In [31]:
# and we'll drop our coulum arr_time because it was a temporary column and also Arrival_Time

df.drop(['arr_time'], axis=1, inplace=True)
df.drop(['Arrival_Time'], axis=1, inplace=True)

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10682 entries, 0 to 10682
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10682 non-null  object
 1   Source           10682 non-null  object
 2   Destination      10682 non-null  object
 3   Route            10682 non-null  object
 4   Duration         10682 non-null  object
 5   Total_Stops      10682 non-null  object
 6   Additional_Info  10682 non-null  object
 7   Price            10682 non-null  int64
 8   Date             10682 non-null  int32
 9   Month            10682 non-null  int32
 10  Year             10682 non-null  int32
 11  Dep_hrs          10682 non-null  int32
 12  Dep_min          10682 non-null  int32
 13  Arr_Hrs          10682 non-null  int32
 14  Arr_Min          10682 non-null  int32
dtypes: int32(7), int64(1), object(7)
memory usage: 1.0+ MB

In [33]:
# here we can drop Route also
df.drop(['Route'], axis=1, inplace=True)

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10682 entries, 0 to 10682
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10682 non-null  object
 1   Source           10682 non-null  object
 2   Destination      10682 non-null  object
 3   Duration         10682 non-null  object
 4   Total_Stops      10682 non-null  object
 5   Additional_Info  10682 non-null  object
 6   Price            10682 non-null  int64
 7   Date             10682 non-null  int32
 8   Month            10682 non-null  int32
 9   Year             10682 non-null  int32
 10  Dep_hrs          10682 non-null  int32
 11  Dep_min          10682 non-null  int32
 12  Arr_Hrs          10682 non-null  int32
 13  Arr_Min          10682 non-null  int32
dtypes: int32(7), int64(1), object(6)
memory usage: 959.7+ KB

In [35]:
df.head(2)

,Airline,Source,Destination,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Dep_hrs,Dep_min,Arr_Hrs,Arr_Min
0,IndiGo,Banglore,New Delhi,2h 50m,non-stop,No info,3897,24,3,2019,22,20,1,10
1,Air India,Kolkata,Banglore,7h 25m,2 stops,No info,7662,1,5,2019,5,50,13,15

In [36]:
# we can convert Duration also

df['Duration_new']=df['Duration'].str.split(' ')
# df['Duration_Hrs']=df['Duration'].str.split(' ').str[0].str.split('h').str[0].astype(int)
# df['Duration_Min']=df['Duration'].str.split(' ').str[1].str.split('m').str[0].astype(int)

In [37]:
df['Duration_Hrs']=df['Duration_new'].str[0].str.split('h').str[0]

In [38]:
df['Duration_Hrs']

0         2
1         7
2        19
3         5
4         4
         ..
10678     2
10679     2
10680     3
10681     2
10682     8
Name: Duration_Hrs, Length: 10682, dtype: object

In [39]:
df['Duration_Min']= df['Duration_new'].str[1].str.split('m').str[0]

In [40]:
df.head()

,Airline,Source,Destination,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Dep_hrs,Dep_min,Arr_Hrs,Arr_Min,Duration_new,Duration_Hrs,Duration_Min
0,IndiGo,Banglore,New Delhi,2h 50m,non-stop,No info,3897,24,3,2019,22,20,1,10,"[2h, 50m]",2,50
1,Air India,Kolkata,Banglore,7h 25m,2 stops,No info,7662,1,5,2019,5,50,13,15,"[7h, 25m]",7,25
2,Jet Airways,Delhi,Cochin,19h,2 stops,No info,13882,9,6,2019,9,25,4,25,[19h],19,NaN
3,IndiGo,Kolkata,Banglore,5h 25m,1 stop,No info,6218,12,5,2019,18,5,23,30,"[5h, 25m]",5,25
4,IndiGo,Banglore,New Delhi,4h 45m,1 stop,No info,13302,1,3,2019,16,50,21,35,"[4h, 45m]",4,45

In [41]:
# now we can drop Duration and Duration_new
df.drop('Duration', axis=1, inplace=True)
df.drop('Duration_new', axis=1, inplace=True)

In [42]:
df.head(2)

,Airline,Source,Destination,Total_Stops,Additional_Info,Price,Date,Month,Year,Dep_hrs,Dep_min,Arr_Hrs,Arr_Min,Duration_Hrs,Duration_Min
0,IndiGo,Banglore,New Delhi,non-stop,No info,3897,24,3,2019,22,20,1,10,2,50
1,Air India,Kolkata,Banglore,2 stops,No info,7662,1,5,2019,5,50,13,15,7,25

In [43]:
df['Duration_Hrs'].isnull().sum()

0

In [44]:
df['Duration_Min'].isnull().sum()

1032

In [45]:
df['Duration_Min']= df['Duration_Min'].fillna(0)

In [46]:
df['Duration_Min'].isnull().sum()

0

In [47]:
df['Duration_Min'].unique()

array(['50', '25', 0, '45', '30', '5', '15', '35', '10', '20', '55', '40'],
      dtype=object)

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10682 entries, 0 to 10682
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10682 non-null  object
 1   Source           10682 non-null  object
 2   Destination      10682 non-null  object
 3   Total_Stops      10682 non-null  object
 4   Additional_Info  10682 non-null  object
 5   Price            10682 non-null  int64
 6   Date             10682 non-null  int32
 7   Month            10682 non-null  int32
 8   Year             10682 non-null  int32
 9   Dep_hrs          10682 non-null  int32
 10  Dep_min          10682 non-null  int32
 11  Arr_Hrs          10682 non-null  int32
 12  Arr_Min          10682 non-null  int32
 13  Duration_Hrs     10682 non-null  object
 14  Duration_Min     10682 non-null  object
dtypes: int32(7), int64(1), object(7)
memory usage: 1.0+ MB

In [49]:
df[df['Duration_Hrs']=='5m']
# This is an invalid value or outlier. We can simply remove it and then we can convert it into numerical data

,Airline,Source,Destination,Total_Stops,Additional_Info,Price,Date,Month,Year,Dep_hrs,Dep_min,Arr_Hrs,Arr_Min,Duration_Hrs,Duration_Min
6474,Air India,Mumbai,Hyderabad,2 stops,No info,17327,6,3,2019,16,50,16,55,5m,0

In [50]:
df.drop(index=6474, inplace=True)

In [51]:
df['Duration_Hrs'].value_counts()

2     2402
1      621
3      501
7      487
5      481
9      445
12     428
8      424
13     407
11     365
10     355
6      340
14     337
15     268
23     264
26     241
16     234
4      222
22     218
24     197
21     196
25     186
27     179
20     162
18     141
19     134
17     129
28      94
29      65
30      49
38      34
37      17
33      13
32       9
34       8
36       7
35       7
31       6
47       2
42       2
39       2
41       1
40       1
Name: Duration_Hrs, dtype: int64

In [52]:
df['Duration_Hrs']=df['Duration_Hrs'].astype(int)

In [53]:
df['Duration_Min'].value_counts()

30    1446
0     1031
20     997
50     972
35     939
55     910
15     903
45     896
25     803
40     636
5      623
10     525
Name: Duration_Min, dtype: int64

In [54]:
df['Duration_Min']=df['Duration_Min'].astype(int)

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10681 entries, 0 to 10682
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10681 non-null  object
 1   Source           10681 non-null  object
 2   Destination      10681 non-null  object
 3   Total_Stops      10681 non-null  object
 4   Additional_Info  10681 non-null  object
 5   Price            10681 non-null  int64
 6   Date             10681 non-null  int32
 7   Month            10681 non-null  int32
 8   Year             10681 non-null  int32
 9   Dep_hrs          10681 non-null  int32
 10  Dep_min          10681 non-null  int32
 11  Arr_Hrs          10681 non-null  int32
 12  Arr_Min          10681 non-null  int32
 13  Duration_Hrs     10681 non-null  int32
 14  Duration_Min     10681 non-null  int32
dtypes: int32(9), int64(1), object(5)
memory usage: 959.6+ KB

In [56]:
df['Total_Stops'].unique()

array(['non-stop', '2 stops', '1 stop', '3 stops', '4 stops'],
      dtype=object)

In [57]:
df['Total_Stops'].value_counts()

1 stop      5625
non-stop    3491
2 stops     1519
3 stops       45
4 stops        1
Name: Total_Stops, dtype: int64

In [58]:
df['Stop']=df['Total_Stops'].str.split(' ').str[0]

In [59]:
df.drop('Total_Stops', axis=1, inplace=True)

In [60]:
df['Stop'].value_counts()

1           5625
non-stop    3491
2           1519
3             45
4              1
Name: Stop, dtype: int64

In [61]:
df[df['Stop']=='non-stop']

,Airline,Source,Destination,Additional_Info,Price,Date,Month,Year,Dep_hrs,Dep_min,Arr_Hrs,Arr_Min,Duration_Hrs,Duration_Min,Stop
0,IndiGo,Banglore,New Delhi,No info,3897,24,3,2019,22,20,1,10,2,50,non-stop
5,SpiceJet,Kolkata,Banglore,No info,3873,24,6,2019,9,0,11,25,2,25,non-stop
11,IndiGo,Kolkata,Banglore,No info,4174,18,4,2019,20,20,22,55,2,35,non-stop
12,Air India,Chennai,Kolkata,No info,4667,24,6,2019,11,40,13,55,2,15,non-stop
14,IndiGo,Kolkata,Banglore,No info,4804,24,4,2019,17,15,19,50,2,35,non-stop
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10677,SpiceJet,Banglore,Delhi,No check-in baggage included,3257,21,5,2019,5,55,8,35,2,40,non-stop
10678,Air Asia,Kolkata,Banglore,No info,4107,9,4,2019,19,55,22,25,2,30,non-stop
10679,Air India,Kolkata,Banglore,No info,4145,27,4,2019,20,45,23,20,2,35,non-stop
10680,Jet Airways,Banglore,Delhi,No info,7229,27,4,2019,8,20,11,20,3,0,non-stop
10681,Vistara,Banglore,New Delhi,No info,12648,1,3,2019,11,30,14,10,2,40,non-stop

In [62]:
# here we want to convert non-stop into 0 so that we can make it numerical
df['Stop']=df['Stop'].replace('non-stop', 0)

In [63]:
df['Stop'].value_counts()

1    5625
0    3491
2    1519
3      45
4       1
Name: Stop, dtype: int64

In [64]:
df.info()
# now we can convert stop into numerical

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10681 entries, 0 to 10682
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10681 non-null  object
 1   Source           10681 non-null  object
 2   Destination      10681 non-null  object
 3   Additional_Info  10681 non-null  object
 4   Price            10681 non-null  int64
 5   Date             10681 non-null  int32
 6   Month            10681 non-null  int32
 7   Year             10681 non-null  int32
 8   Dep_hrs          10681 non-null  int32
 9   Dep_min          10681 non-null  int32
 10  Arr_Hrs          10681 non-null  int32
 11  Arr_Min          10681 non-null  int32
 12  Duration_Hrs     10681 non-null  int32
 13  Duration_Min     10681 non-null  int32
 14  Stop             10681 non-null  object
dtypes: int32(9), int64(1), object(5)
memory usage: 959.6+ KB

In [65]:
df['Stop']=df['Stop'].astype(int)

In [66]:
# or we could simply do it using map function
# df['Total_Stops']=df['Total_Stops'].map({'non-stop':0, '1 stop':1, '2 stop':2, '3 stop':3, '4 stop':4, np.nan:1})

In [67]:
df['Stop'].isnull().sum()

0

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10681 entries, 0 to 10682
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10681 non-null  object
 1   Source           10681 non-null  object
 2   Destination      10681 non-null  object
 3   Additional_Info  10681 non-null  object
 4   Price            10681 non-null  int64
 5   Date             10681 non-null  int32
 6   Month            10681 non-null  int32
 7   Year             10681 non-null  int32
 8   Dep_hrs          10681 non-null  int32
 9   Dep_min          10681 non-null  int32
 10  Arr_Hrs          10681 non-null  int32
 11  Arr_Min          10681 non-null  int32
 12  Duration_Hrs     10681 non-null  int32
 13  Duration_Min     10681 non-null  int32
 14  Stop             10681 non-null  int32
dtypes: int32(10), int64(1), object(4)
memory usage: 917.9+ KB

In [69]:
df['Additional_Info'].unique()
# here we can see two similar unique values No info and No Info so we have to replace it with any one value

array(['No info', 'In-flight meal not included',
       'No check-in baggage included', '1 Short layover', 'No Info',
       '1 Long layover', 'Change airports', 'Business class',
       'Red-eye flight', '2 Long layover'], dtype=object)

In [70]:
df['Additional_Info']=df['Additional_Info'].replace('No info', 'No Info')

In [71]:
df['Additional_Info'].unique()

array(['No Info', 'In-flight meal not included',
       'No check-in baggage included', '1 Short layover',
       '1 Long layover', 'Change airports', 'Business class',
       'Red-eye flight', '2 Long layover'], dtype=object)

In [72]:
df['Source'].unique()

array(['Banglore', 'Kolkata', 'Delhi', 'Chennai', 'Mumbai'], dtype=object)

In [73]:
df['Destination'].unique()

array(['New Delhi', 'Banglore', 'Cochin', 'Kolkata', 'Delhi', 'Hyderabad'],
      dtype=object)

In [74]:
# Airline, source, destination00 are categorical features and we can convert them into numerical featrue 
# using one hot encoding
# importing necessary library

from sklearn.preprocessing import OneHotEncoder

In [75]:
# creating object for 4 categorical features
encoder_1=OneHotEncoder()
encoder_2=OneHotEncoder()
encoder_3=OneHotEncoder()

In [76]:
encoder_1.fit_transform(df[['Airline']])

<10681x12 sparse matrix of type '<class 'numpy.float64'>'
	with 10681 stored elements in Compressed Sparse Row format>

In [77]:
encoder_1.fit_transform(df[['Airline']]).toarray()

array([[0., 0., 0., ..., 0., 0., 0.],
       [0., 1., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 1., 0.],
       [0., 1., 0., ..., 0., 0., 0.]])

In [78]:
pd.DataFrame(encoder_1.fit_transform(df[['Airline']]).toarray(), columns=encoder_1.get_feature_names_out())

,Airline_Air Asia,Airline_Air India,Airline_GoAir,Airline_IndiGo,Airline_Jet Airways,Airline_Jet Airways Business,Airline_Multiple carriers,Airline_Multiple carriers Premium economy,Airline_SpiceJet,Airline_Trujet,Airline_Vistara,Airline_Vistara Premium economy
0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...
10676,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
10677,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
10678,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
10679,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0
10680,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [79]:
enc_1=pd.DataFrame(encoder_1.fit_transform(df[['Airline']]).toarray(), columns=encoder_1.get_feature_names_out())

In [80]:
# similarly we can do the same to Source also
enc_2=pd.DataFrame(encoder_2.fit_transform(df[['Source']]).toarray(), columns=encoder_2.get_feature_names_out())

In [81]:
# similarly we can do the same to Destination also
enc_3=pd.DataFrame(encoder_3.fit_transform(df[['Destination']]).toarray(), columns=encoder_3.get_feature_names_out())

In [82]:
# now we can easily concatenate enc_1, enc_2 and enc_3 with df and we can delete columns Airline, Source, Destination
df.drop(['Airline', 'Source', 'Destination'], axis=1, inplace=True)

In [83]:
# concatination enc 1,2,3 with df

df_new=pd.concat([df, enc_1, enc_2, enc_3], axis=1)

In [84]:
df_new.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10683 entries, 0 to 9039
Data columns (total 35 columns):
 #   Column                                     Non-Null Count  Dtype
---  ------                                     --------------  -----
 0   Additional_Info                            10681 non-null  object
 1   Price                                      10681 non-null  float64
 2   Date                                       10681 non-null  float64
 3   Month                                      10681 non-null  float64
 4   Year                                       10681 non-null  float64
 5   Dep_hrs                                    10681 non-null  float64
 6   Dep_min                                    10681 non-null  float64
 7   Arr_Hrs                                    10681 non-null  float64
 8   Arr_Min                                    10681 non-null  float64
 9   Duration_Hrs                               10681 non-null  float64
 10  Duration_Min                               10681 non-null  float64
 11  Stop                                       10681 non-null  float64
 12  Airline_Air Asia                           10681 non-null  float64
 13  Airline_Air India                          10681 non-null  float64
 14  Airline_GoAir                              10681 non-null  float64
 15  Airline_IndiGo                             10681 non-null  float64
 16  Airline_Jet Airways                        10681 non-null  float64
 17  Airline_Jet Airways Business               10681 non-null  float64
 18  Airline_Multiple carriers                  10681 non-null  float64
 19  Airline_Multiple carriers Premium economy  10681 non-null  float64
 20  Airline_SpiceJet                           10681 non-null  float64
 21  Airline_Trujet                             10681 non-null  float64
 22  Airline_Vistara                            10681 non-null  float64
 23  Airline_Vistara Premium economy            10681 non-null  float64
 24  Source_Banglore                            10681 non-null  float64
 25  Source_Chennai                             10681 non-null  float64
 26  Source_Delhi                               10681 non-null  float64
 27  Source_Kolkata                             10681 non-null  float64
 28  Source_Mumbai                              10681 non-null  float64
 29  Destination_Banglore                       10681 non-null  float64
 30  Destination_Cochin                         10681 non-null  float64
 31  Destination_Delhi                          10681 non-null  float64
 32  Destination_Hyderabad                      10681 non-null  float64
 33  Destination_Kolkata                        10681 non-null  float64
 34  Destination_New Delhi                      10681 non-null  float64
dtypes: float64(34), object(1)
memory usage: 2.9+ MB

In [85]:
df_new.head(2)

,Additional_Info,Price,Date,Month,Year,Dep_hrs,Dep_min,Arr_Hrs,Arr_Min,Duration_Hrs,...,Source_Chennai,Source_Delhi,Source_Kolkata,Source_Mumbai,Destination_Banglore,Destination_Cochin,Destination_Delhi,Destination_Hyderabad,Destination_Kolkata,Destination_New Delhi
0,No Info,3897.0,24.0,3.0,2019.0,22.0,20.0,1.0,10.0,2.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
1,No Info,7662.0,1.0,5.0,2019.0,5.0,50.0,13.0,15.0,7.0,...,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0

In [86]:
enc_1.shape

(10681, 12)

In [87]:
enc_2.shape

(10681, 5)

In [88]:
enc_3.shape

(10681, 6)

In [89]:
df.shape

(10681, 12)

In [90]:
df_new.shape

(10683, 35)

In [91]:
# here two values are extra so we'll have to check
df_new.isnull().sum()

Additional_Info                              2
Price                                        2
Date                                         2
Month                                        2
Year                                         2
Dep_hrs                                      2
Dep_min                                      2
Arr_Hrs                                      2
Arr_Min                                      2
Duration_Hrs                                 2
Duration_Min                                 2
Stop                                         2
Airline_Air Asia                             2
Airline_Air India                            2
Airline_GoAir                                2
Airline_IndiGo                               2
Airline_Jet Airways                          2
Airline_Jet Airways Business                 2
Airline_Multiple carriers                    2
Airline_Multiple carriers Premium economy    2
Airline_SpiceJet                             2
Airline_Trujet                               2
Airline_Vistara                              2
Airline_Vistara Premium economy              2
Source_Banglore                              2
Source_Chennai                               2
Source_Delhi                                 2
Source_Kolkata                               2
Source_Mumbai                                2
Destination_Banglore                         2
Destination_Cochin                           2
Destination_Delhi                            2
Destination_Hyderabad                        2
Destination_Kolkata                          2
Destination_New Delhi                        2
dtype: int64

In [92]:
df_new.tail(2)
# here we can see that source and destination are same therefore this is null value and we'll have to remove it

,Additional_Info,Price,Date,Month,Year,Dep_hrs,Dep_min,Arr_Hrs,Arr_Min,Duration_Hrs,...,Source_Chennai,Source_Delhi,Source_Kolkata,Source_Mumbai,Destination_Banglore,Destination_Cochin,Destination_Delhi,Destination_Hyderabad,Destination_Kolkata,Destination_New Delhi
6474,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
9039,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0

In [93]:
df_new.dropna(inplace=True)

In [94]:
df_new.shape

(10679, 35)

In [95]:
df_new.isnull().sum()

Additional_Info                              0
Price                                        0
Date                                         0
Month                                        0
Year                                         0
Dep_hrs                                      0
Dep_min                                      0
Arr_Hrs                                      0
Arr_Min                                      0
Duration_Hrs                                 0
Duration_Min                                 0
Stop                                         0
Airline_Air Asia                             0
Airline_Air India                            0
Airline_GoAir                                0
Airline_IndiGo                               0
Airline_Jet Airways                          0
Airline_Jet Airways Business                 0
Airline_Multiple carriers                    0
Airline_Multiple carriers Premium economy    0
Airline_SpiceJet                             0
Airline_Trujet                               0
Airline_Vistara                              0
Airline_Vistara Premium economy              0
Source_Banglore                              0
Source_Chennai                               0
Source_Delhi                                 0
Source_Kolkata                               0
Source_Mumbai                                0
Destination_Banglore                         0
Destination_Cochin                           0
Destination_Delhi                            0
Destination_Hyderabad                        0
Destination_Kolkata                          0
Destination_New Delhi                        0
dtype: int64

In [96]:
# now we are left with only one categorical feature, we can convert it into numerical feature using label encoder
# importing necessary library

from sklearn.preprocessing import LabelEncoder

In [97]:
# creating object
encoder_4=LabelEncoder()

In [98]:
enc_4=pd.DataFrame(encoder_4.fit_transform(df_new[['Additional_Info']]))

C:\Users\alwar\anaconda3\lib\site-packages\sklearn\preprocessing\_label.py:115: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [99]:
enc_4.value_counts()

6    8344
5    1982
7     320
0      19
4       7
3       4
1       1
2       1
8       1
dtype: int64

In [100]:
enc_4.shape

(10679, 1)

In [101]:
enc_4.value_counts()

6    8344
5    1982
7     320
0      19
4       7
3       4
1       1
2       1
8       1
dtype: int64

In [102]:
# now we can easily concatenate this enc_4 with df_new

df_new=pd.concat([df_new, enc_4], axis=1)

In [103]:
df_new.head()

,Additional_Info,Price,Date,Month,Year,Dep_hrs,Dep_min,Arr_Hrs,Arr_Min,Duration_Hrs,...,Source_Delhi,Source_Kolkata,Source_Mumbai,Destination_Banglore,Destination_Cochin,Destination_Delhi,Destination_Hyderabad,Destination_Kolkata,Destination_New Delhi,0
0,No Info,3897.0,24.0,3.0,2019.0,22.0,20.0,1.0,10.0,2.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,6.0
1,No Info,7662.0,1.0,5.0,2019.0,5.0,50.0,13.0,15.0,7.0,...,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,6.0
2,No Info,13882.0,9.0,6.0,2019.0,9.0,25.0,4.0,25.0,19.0,...,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,6.0
3,No Info,6218.0,12.0,5.0,2019.0,18.0,5.0,23.0,30.0,5.0,...,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,6.0
4,No Info,13302.0,1.0,3.0,2019.0,16.0,50.0,21.0,35.0,4.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,6.0

In [104]:
# here we can drop the column Additional_info

df_new.drop('Additional_Info', axis=1, inplace=True)

In [105]:
# Now we can rename our column 0

df_new['Additional_Info']=df_new[0]

In [106]:
# and we can drop column 0
df_new.drop([0], axis=1, inplace=True)

In [107]:
df_new.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10681 entries, 0 to 9039
Data columns (total 35 columns):
 #   Column                                     Non-Null Count  Dtype
---  ------                                     --------------  -----
 0   Price                                      10679 non-null  float64
 1   Date                                       10679 non-null  float64
 2   Month                                      10679 non-null  float64
 3   Year                                       10679 non-null  float64
 4   Dep_hrs                                    10679 non-null  float64
 5   Dep_min                                    10679 non-null  float64
 6   Arr_Hrs                                    10679 non-null  float64
 7   Arr_Min                                    10679 non-null  float64
 8   Duration_Hrs                               10679 non-null  float64
 9   Duration_Min                               10679 non-null  float64
 10  Stop                                       10679 non-null  float64
 11  Airline_Air Asia                           10679 non-null  float64
 12  Airline_Air India                          10679 non-null  float64
 13  Airline_GoAir                              10679 non-null  float64
 14  Airline_IndiGo                             10679 non-null  float64
 15  Airline_Jet Airways                        10679 non-null  float64
 16  Airline_Jet Airways Business               10679 non-null  float64
 17  Airline_Multiple carriers                  10679 non-null  float64
 18  Airline_Multiple carriers Premium economy  10679 non-null  float64
 19  Airline_SpiceJet                           10679 non-null  float64
 20  Airline_Trujet                             10679 non-null  float64
 21  Airline_Vistara                            10679 non-null  float64
 22  Airline_Vistara Premium economy            10679 non-null  float64
 23  Source_Banglore                            10679 non-null  float64
 24  Source_Chennai                             10679 non-null  float64
 25  Source_Delhi                               10679 non-null  float64
 26  Source_Kolkata                             10679 non-null  float64
 27  Source_Mumbai                              10679 non-null  float64
 28  Destination_Banglore                       10679 non-null  float64
 29  Destination_Cochin                         10679 non-null  float64
 30  Destination_Delhi                          10679 non-null  float64
 31  Destination_Hyderabad                      10679 non-null  float64
 32  Destination_Kolkata                        10679 non-null  float64
 33  Destination_New Delhi                      10679 non-null  float64
 34  Additional_Info                            10679 non-null  float64
dtypes: float64(35)
memory usage: 2.9 MB

Now we have converted our dataset ready to go for ML Algo Training